node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 9432720
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "!\236y>\343\321\235\273\n\325\273\276@\353d=\033s,=\204\360\214=M\236\316;]\205z<.\2726>\025\372D\275i\345E=\252\215\254\275#\026\234\275X\240\245=|\234\004\276\303\350E<H\316\342\275\240\007\225\275>,\340\275X>\004\276`\035\243\275\024\365\202<\243B\335=\3430\210=3g.=\256\2060=\326k:\275y_\254\2758\251\225=\361\237/\2751}`=(Z\360=E\245\227\273\370Z\205\276Wb =J[\257\275\352\252\025>\033Z\346\274\376V\235=\221\214N\276\227\321I=~?\202=OlP\276XlB\276\360lP\276\347\376\355<\223\3635\276Z\2257\275\303\251\347=\221|s>s\361\250\276\027\225\210\276!\336\230\274R\366\177<1\333\003>\304\305\334=\263\325J<\217\360\377\275\203\233|=M\236\366=\310\322<\275\220\347\321\275_!\000>\224j\002>_p\223<\336X;>o\202\351\274\000\272m\276\352h\216\275\244f\365\275\305\377\342\274\247\003&=\252\275\023>\300\364\t>^`x=\235\000\017\275\2104{\276\001\325\227>\0315\364\275y\021X=\222/\237\274I\027\214\275\227\000\272<\3207/>\214\214b\274}I\372=I&\254\275\027J\336\275\274fu;\304$\306\275j\331g\276x\330\336=\350\346\212\275\370\013\273=\344\267_\276\242\261\033\274x\304,\276^\340\034\275\214\3401>:!\247=\200+Q\276\025\177\317\275\260\033\030>\212:9\276\246$\300=\360\022V>\217\254u\275\315\3626\276\221\314\032>{2\001=Q8\261\275\260\266h\276}\257.\275i{\272=Y4,\275#V\264\275\203\367>>\016\303\021=\302o\017\276\365\200\366\275\325\204\035>\016/\022>\311\305\271=b6\000>\226\222\251\275\316g\305=\240\226\256=rf\244;\241\255\245\276\266W\261\275\244\001\017=;D\247=\022;\301<\336\005\326\274\0254\260>\'\271\022=\263\000_\275\257\035\341\272\341dq>\320\252\322\275\035\313\202>v\322\273=\317\301\222=}B\243\275\322\206\250=\363\364\330;\306Q&\275\256\315\007\276\0017r\275\t\000\302=)\245q\275wv!>\360c\206=\306\"\325<\311\252\257=\322G\343\275:\370#=\000\321Y=\254\210\035\276\023\333\n\276\241\262\225\275\257\321\004>0\2367>.G\030<\255\330\376\275\025\276\020\276\357$\330<\305O\212\274\347V\330\275\247\265J\2751\261^\275I\336\220\276)\341\377=\ndq>\202G\224=a\217\206\274kz\\\276vG\261\275\206\235H>y\252\014\276\201\002\210\275T6\324=\017u\277=\326T\367\275\263\330\212>#\206)\276\364)\000>\363\250\203\275\362\364\225=\2449C\2744\274\214=\312\204~=!\033\217=\177b\237>\346R\312=\327\017\251\274Q\027\177=D\203\263=\351\341U=\024\r\335=\310\275\253>\255\032m=\225\017\t>~Rl=\336{:\275\030\266\251>\223\033\335=\0075\001>\372Y\225>\224o\\\275\335\237\233=<%y<3\006\177\274\037\340|\276\302\006C\275\327\321\250\275.|n\273\323,\325\274\365c?\2765|\"\275G\2349=\3337\230\276\335\337\213\275m\352\201<\002\213\026\275r\304\347\275eYk=\245&1=\254\372\033=\177\373k\275\177W0\273\307\331\265\275H!\302\275\024\240N\276Y\300\316=\365\347v\275T\0013=\325\242\323=R\006f=`u\202\275n\300\016\276Xl\274=\343`\366\273+\256\377\275\220\242\260>Q\3214\275\251\215\014\276\244VN\276\260\221\256\275Pm\007\276_\260b\276\023\244M=\364rh=\351S\321\275\276\301\216=\244\333\362=[\272(=\351\236\r>\257\372\034\276\363c/\276\004\014\261\275\022\305\373=\351r\022=\360\272\245\275-\217$=\021\304 \276\326e\300\274L\257\314<\277Wm:F\017\233\275\371u\235=\3050\351=\r\333`=\320*\205<\344\004\004\276\356g\206=\324*\372\275\324\233\247=GC\240\275\276\336,\276\216\372\t>\225\261%\274\2467\020\276\252\202p\276\370p{\275\370\246\316\274$(Y=*\2779>]\374\224\276\257`e;\224\351\257\274\214\317\234=:\276\'\276\305\027\213>f\314\366=bV\035\276)\005\265\275\237\257\263\274}\272]\2766\333\342=~\345\010=\333\026\226<}\310\177>52\n\276\342\264\203\275\303\020l>\365\364\360=\330( =\317m\212\273\263\335\354\275\205n\t\276\312\244+\274\206\r1>\305y\315<d\254\212\276D\347j=\2628\214=\233\032\220=.\032\313=\336q\251\275\270l\307\275\236\261\'>\367s\374\275/\222\202<9[\377\275\\\213\r\276W\246\002=\351\276\364\275\261\366\201=Tm\037\274/\311C=\364z\'\276\277}s<\024K\350\275\001/\031<{m\025>{\2634\276\013?\215\276<\265\314<~\r\316\275zo\352=\341^\213\275\263\027\003>\255\320s\275\273\030@>\304\200\'\276\002f\311<*c\016>W\306\225=\374O\250>Ku\250\275.\002\356\275\021\307\343\273\023\321\366\274\020\244\255;\241\344m=\224\214N\276\031<_>4\351U>w\277r\275\013A}>\221\274\251\275]\330\324\273\205j\207\275Z\026?=\271\030\260\276\005\234\004>\320\307\215\275\225C\203\275\374\365\241;\365H%>\213;\026\276\260\353!>\357(\010\276\316\253\222\271\274\\E\275\202\235\251<\2209M=[\006@\275\"\3513=\031\230S8\2057\325\275\356+:>\330q\236=\025t\216>C\247\307\275\030\030\016\276\022\253\037\276\316\362X=\243\271G>\036!\031=\205\317\037\276\326<\247=&\330\361:t\tF\276\370h\313=2\204\207\275K\3152\276\244\275l>F\200\252=>Iq\275R\370\312\275\220m\200=k\272\200\276>\031\236<~A\322\275v\320q<\021\301:>$\211\000\276d\316.\276O\303\221<K:p=\311\3725>\203:\206\275\312h2>\213\\\'>;!;=\2511\226\275\306y\265=\373\275}\275\243\002\364=\316\233\355\273\177\273^=F\240\304\275Ts\005\276\212\245\035\274Q\223\026>N\217\312=N\030_>0\312\364\274\304\204\211>\266\307\346=#&\320:\034\331\005\276F\331C>3\177\304\275\355\321\332=[2\'=\343\003\217=\005\355\320\275H\2717\275\353\010W>\370T\253=\355-\r\276\326\0108;\224Q\377=\235\201a=Q\017\230\274\257\374G>\035\231\315=\277\230X\276e\025;\275\031\014`<\214m\234<18\321=\226R\253<\265\276\375\275Fg\334=qC\276\275p\344\177>\310\264\275=\204#\205=\036\266\367\275@\r\227\276\337\341\221>\264\"\347=4?\312\274 \357}\275\030\247\245=0It=\337\327\325=\324\335\023\275\273\362\275\275\031TQ>\215=`;\207\251\237\275\02276<\305\332\273\273h\337\022<\266O\254>\027f\024\276\275\022\335<\222M\264;\353\316\332\272\267\005\210\274brT\274\310\306\020\275\306\366\006\276\311\354\344\274\377\311\026>|\273\275=A\"1\275=\t\316\275$\216\314=\346\036O<\rR\315\276/\024=\274\371\025\r\276*\365*\276\025\256\003\276\361\350\366\274\354bD=\335\345\233;-\001\237\275i\010\007\276<G\003;\312\010\360=\363\223\201:\350o\231\276\264l\376\274\314\323\">\223\310\222\275\235\227\304=\022\260\002\276\331\217-\275\226\363\301\275\352e\315\275\245Z\217=\356\333\014>\326d\033>}\377/=Yn;\275m\025\274\275\226\347\234;\361d\327=\017\240\245\275\222\016\365;\233\274\310>\271\022c=\002\254\002\276r\215\020=\352\236\316\276\304\024e=\246}\000>~\2619\276\202`\022\275\200\037\320<2r\375\274\307\330/=WHg\275-\272\341<\321\"\243\275\004f\372=w\"o>}\262\366=RR\242\275\222\266w>\360\226\201\274\253[\344==\252\357\275\215\037P=\262kh\273\n\000\331\275\367kK>,`\335=c\352\274\274\376*l=\235\035\250=c\344C=\320\0160>\334\303\210\274<\256\266\275\370_\005=M#\231=X\360i\276\000\302P\276\203\021\242=\354P\310=\200\362\236\275!\231\320\273`}{\274\255Pr\275e\222\354=Q\367^\272\034\304h=3\005\240>%\217\360=\357B\233\275No\207=P\351N>\216\271.>S?\227>E9\347\272\2238/\275\222\312\020\276\260\344_\2765/\250=\352\302\377\275\202\257\343\274Y3?\275\236\256\203\275F\363\003\276/\267q\276q\220\245=\235\363\200=.t?>\355IE\275ha\3229I\300v\276A,p\275\r\211\373<a\226\014\276\"\310\215=\334\222v>U\026\262\275\232.\027\276$T\263\275+&\034\275\264F\373=\007T\340=t&X\276\214:P\276\321\030\227\273\325x\276=a\2535=\322\035\252\275Nd\216>\300\360\357<ZX\001>\342\027\324\275>]1=\321\027\207=B\373#\276\320*\235>\005\355\202=\030\356\'>\251\266\323\275\220\355\304=\331\006|=\367AU<\t\217~>R\315>>\007\203I\274\377\357\253\275\362\303\004\275Y-\214\275Ux\214\275\336\332\351<7\273\275\274\231\375F\275V\223\267\275\376\230\225=\021\024U>\302\252\355\27510\025>\372\351\316;&\303{\2751gj\275H2\216\276\032\3434<\374X\343\274\006\027<\274\354\027\020\275\357\373\211=\333\257\211\276\317\366G>b\331\375\274\355\351(=gE\017<c\013c>\032\304\276\274\032l\364\275\371\245\332=_,\003=\333\223\027\275\311\347\002\275k\251\016>\206i\020>\256g\315\275\314 7\2766\235\004>\274uY>H\200)>\031o}\275\202\327\273<k=\362=\256AA>\370>\306\275\016\310\226=c\335\020=J4\262<\022o\010>\365\352\312\275@+3\276\245\372\242\275\346Z\013>\274VJ<\254\220{\274Nyv\276\260\021\210\275\312G\370=>\334\264\275\2748\326\2759\322r\275L\345(\276\264\210W\276\273~\314\275\236\230\366\275N\007\'>5\235\227\275z^\321<\302\306m=X8J\2753[\030>\333lE\275\210\223\254<|\350\225\276G+\226\274(`\204\276.\221\331=\032\014\344;\246\330L\275i\230\356\275;\364\271\274`\253\021>|\253\214=\027N\312>\275\352\370\275\336\260\303\275\276]\026=C\255\r\276;\352\217><\327\357=\227\220\000>\007\335\352\275NV\361<k\335U\272\333\305\251=t\372\324=\370\313<\275\261s~=\201\347Y\276\275;\026>\236\354\241\275%\341\362=\317a\343\274>\303$\275\027\262R>\354\272\223>\207^\010\276\220z$\276\337\203&\276[\354a>\332\200\246\275\240\206\322=\200\333K=\205\373\337<7-V\274\326 .\276f\301\246=\335g\205>iKL\275;ys=\024k\242=\326\271\372=\254\r=\276\265\014\327\275\002\255\252;e\017\301<\3249\274\275\331]\267=^\357\204\275\356\257\232<\305\022\355\275iKA\276\303\341\r=`\001\353<1\251\364<\217\227C>\261\203s=R\321\233;\301/\037\274\r`\025\272\331\366t\276S\303\026\274J\234C\273x(\262\2741M\365=#B\253\276\222\267\250=\024|\345\275]8\247\275\236\324\270=\336\t\264=\312\242\366\273\364P\034>\271\"5=\031\310\223>.x \274\371\322\023=,\262\352\275\245\010d\276%\250\313\275\243\324\':\004\331\324\274ft&\276\222\264\032\276\246!\241\276\246z\320=\016*\250\2754\245\200=\3752w=\314_\0069\273\006\005\276\217A1<d\2431\275p\214J\274\305\351\210\276\222E\261<l\227\237\275^\245\031\276\213\313 >\276OE>\036\243#\2767. \276N\350\010>l\216\277\275\206J\020\274\337\334q\276\243C\006>3G \276\215\206\330\275#\347\374<<\017z\276\240\340\345\275\243\313\352\275Rf.\275\277\340\371<\317+\310\275\321sQ\274\331\036\263\274Y\034&>\267F9\276!\3624\276\352$\243\272\n\243\200\275\276,(>\235\026\265\275wm\255\275s\030\244\275$\345\337<\336\244\201=\352\3433>Z\306\212\275\347A->\005\375\035\275t\001>>9n\253=\367\316\304\271\362\343|>\340`\035\274\344\003R\2756\n\213=\350\344\025=\032<y>\2530S=\305>\355=\316\331\341\273S\342 \276\273\342:\2739\017\367\275\215\314\217\276\303\n\324=\016\025\256\275\334\025\312\275w\3426=\313L)\276\313\277\234<\271\"z\275\032\030h\276\020\360\277\275\375r\224\274LW9>\360\257\\\276J9\035=\177\033\367\275\325\017\262=\337\006\343\275\375^\275;n\254\t=\373\013\263\275\201\254(>\2042\221\275\236\276\326;\0307U>\311\272\305=\016\237&\276I{C\275\216\351\367\275pnY>\023\370\034\276/\255\016>\266\206\202>\022\250\216\274\272\231\327\275\222\221;\276\255\271;\276\206\201\231\273\377\341\215\275D\207\372\275Y\"\317=\'7\226\275\240d\201=\231\254\320\275 \016i\276O\235#\276\215\033\003>\305j\235=\223\r{>\310e#=\273e\231=W\244\211\276*\2043\275\010\205{=F\211\304\274_6\323=\343\276k\274\334,\363=b\301\223\275\3255\201\276\200c\320\275\234\331+>\366\216\022</\252;<\003\203\332=\033#\216=\202x\242\275\271>\333=8Z\271\275O\262\020\276y\224\\\275\323\362\344=\016fg\276X\263\202>o\0221\276\022\260\026=\032\025&;\033\312\276<&\027\213\276\314\343\031\275n\256\202<+m[;\204h\375\275\324ZJ>\252\350\355=\244\366#\276U\355\267=c\336j=v\344q\2746\300\005<o$\361\275\361T\275\275\217\304\327<.\377\214= \017\335=V\263\344\274\232\205(=\227cE\275D\367\017\276(\252\262\276\000\274+\275\346U\264><\0224>\336Hi\275\212\260\002\276\227q\241\276\243|\205\275\255:4=\316\351\231\275\003\367\221\276$\233\225\275\007[\201\2754\242\200\276u\367\361\275\225g\003<V\204\351<{\035\230\272?\274C\275\315)c=\314\221\013>8^4\276=\366\370\274\003<\377\274Q6\220\275|cD\274\t!H\272\252,p>\245\233\346=8\206\316=\276X\360\275\373\003D=f\353\303\274F\2271\276c\316\377\275\371\371\"=\246p\033>\310\370\342=\354<\222=\314\004\235\272\031E\376=\017>?\276\200\002\354\2754\306\223=\\d\020\276w\266W\275\\\321\213>\241\224\274\275\360\320l=o\251\200\275z\353\321=\342\276\036\276s\016y\275x\361\037=\376\203\005>\023^>\275\013x\362=\230\022\216=SXZ\274\365\004\275=\201\3375\276\2756G\275\317\327\226=\177\3127>\251\342Q\276Vg,<\240C\255\275\010i7\275\276i\230\275\006:N\276\342\222\331\274\252\031\336<\226\243%\276h\231\034\275\353\246\201<\002\333M>J\365r\276\262\345\341\274\305_\216\275\251\262\247\276\221\313\335\275\031R\275\274\370\205\211\274<}\000\276u\251\221\274\1770\302=T\3634\276\335T(\276\242\026\225\275)F\242=L\n\231=C\177\207\275|`\205\275\243p\255\275g\250\327\275(y\220\275\222+\004\276g\210\\=c\3251\274\275\272G\276\3219\302\2754s\033>\016\227\272<k\332r=x\364\364=\2208\351\274\371\372\200<\023\253\032\2762{\200\276\321t.>\351\035\327=\260md>\022\256M\275V\257\022\276\245\377!\275\025\263S=\027\347\304>0\356\353:\364\363\257=\003_\236\275\254\225\230=4u\321<\231<n>\030^\005\276fx\330\275\007\204\334<\240hN;[>(=\243H\360=\212>\355\275\006>\273\275\305#[\275\217\363\254\275\034\304\032\2754R\217<Y\326\315\275\017\357\000\276\003\234g=\233\315\334\275\361tI=\2679\214=G\022\006\275B\232\010>\233 \351=x.\261\274P\321\021>\005\216\201>\316cS\276N\301>\275\025\340\004\276\025}\216;\323\250\373<#\3177>R\023/=I/\031\276\321\354;=\001\2341>\343\315\343<J\333 \276J\353\204>:%\366\275\252\005\272\275\027\216A>\274\2311\276\317`f=\221\264+>\361.\255=\026^\253>\350\277G\276\266A\000\275\214\332\030\275%~s>\241L!\275k\001\371\2751v\307=\365\212\236<\252Z\030\2752\371\220=\370\004\212>\334\204w\275\271\221\362\275\203h\037>c\225\236=v\202\253=\201\013\000>\361\261\344\275ft\326\274\216\373\010\276\034s\243\274yx\361;\202|,<ix4>.#\003>\266]\004>\014OU\276\251x\232\274-\n\372\275\374\342%>\357\313\320\275\370u\325\274\000#\270=&M!\276\261U*<\251yP\273\206\311\236>\014\230\035\275y]D\275\214M\030>/)\033\275\202Q\257=\254\262$>\357B\264=\325\334\277\274@\"\235>Gvm\274\256\357u\276\304\3279\274\314\201\217\275\360*}<9\337\000\276\333\220\r\276\332A\270=\031#\366\275\227u\206\276\263\313\215=\005\016\263\275\206\t\373<\027\270o\275m*x\2764\372\005<Y\365!\272\262\337\010\275\246\rb<\266c\033\276)\374\232=\233I9\276\366\272B\276di\237\275Q:\253\274\003\376\236<\323^\233\276"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
