node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 3410796
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "M\237\317\273\333\374\006\276`\214\276=_\214\316=S\322\215\276\234\360\337=\005\361\325\274\200\300\302\275k\024B\276H\006%>\273\315\316=\202\346\005>ROH>E\326D\275\375j\324=n!E\276:\032_\275\226\226\332\275\373v\033\274\212y\264=\225\264:\276\310\021&=ou\277<\313\337\206\276\256\376K>j\371\342\274\177\240\226=A\324\332\275`\272\316\275i\262\267\274\001\315\n>\346\255\035\276\0016\243=^y\032>\010D\031\275\024)\016>\337(\311\275\337w\315\275E\227:=3\\y>d\201K=qgw\273\264d\256=\"\200\213<r\033\007\276\202\202<\276\256\351+=\332\327\224\275{\244\026\275\300D\306=7\274\210\275\335\217\021=R\244\210\276\036$\033>/(\232>\376\035\366\275\332\237d=6\"\037>\257\001\034=0N\253\275\000\234\367=\256\337\'\276\037g\000=\017\270\320=\272{\226=o\007\322\275y82\275u\365\211\276k\231\255\275J\240\037\275\025\217)\276\275\006M>~\340\246\274=>(\276aNk=]\327\021>\375!\362\275D\003\033\274B@S>]J\361<so\005\276\306=\027\276\353\274\360\275\305\235?>\240c\300\275\315\025%>3\220\227=\355\346\274\275\340E7=\310\350\t>\264\210\000\276\234)u\276\220\311\221=x\311\223=\"a\264\275-\3321\276\225\033\025\275\014#\346\274\205t\312=\345\017p\274\031q\357\273\025g\360\275\310\313+=\306\020\241=t\023r\275\004\235\222\275\\\274\230\276y\3602>\237_t>C\273\250\275&\213\336=gHi>\235\234;;gm\227\2740\246\035>d\376K=w\333\255<\256XF\276V\372\034>\177`\004>\226k\372\273\320\233\030<\361\352\304\274u\355\266\275\205I#>\301\240\024\276\31420=\221\356~\276\232\254\227>\376\311\023>D\275Y\275\300\3044\276\033}-\274\013)\336<v\r/>\340\304\270\275\nE\266\275\264O_\275\363!0>9/\027\275\204G\336\274\021x\362=\246\334,>\367\2622:o\2506=\262\205\\=\014\3478\276@\235\325=\322Ht\274w\333\365\275\207\301:\275\274\362\300\275\375\242\245\2759\036\266\275\266\035\214<\246\214<\276h\036\036>\013\261\020\276\376\341\000\276Yh\254=B\210K\276\331\324\234\275\321\235$\276D\334g=H\024\317\275C\221&=Y\335\242\273\265\250\033\276d6p\276\271W\203<\216B\177>\3305]\275ay\275\275\306*\210>ep$>\232\224\240\275t\3515\276\314z\244=\333\010\224=\217\252P>\363G\300\274l\334H>\223\353\345\272\211\332\337\275%=6\275\355\223\272\273\027\377v<\22410>\310Pa\273467\276\375\316\254=\245\217\320\274\227\362q=\365\276K\276\247,\224\275!\345\253\274\013\235\227\275\322\274[\275\r\312S<\325R^=f\246\002\2766\273\007\276\230<\265\275\020v\313\274I\262~>\223\341s>d\374\205=\360\336\013\276E\036,\276\267\3235\276l\r4\276Nm\375=\377V\325\274\271\340\332=~/\230\276E\251$\276\005\327\341=/\360\036=C5\227\275\022\227\310\274\340E\253\276\263\332\340<d\304`\274jL\262\275\242}>\276\261\306\226=3\250\236\275:\001\032\276\\\014\013\276u\037\212\275\267u\031<T\343\010\275,\262\031>Q\353+\276nv\345=\314q\364\275\232\220\224>\016\273`\275\225\237\013<\350vi\275}\234c\275\347\213\211\276\377\337\204\274\315F\312=\204\221\013>\210\377\211\275\363\225\001=\376C.\276\024\003(=\263\014Z\276\021f\242\276\372X{>\265\223\372=g\341\211\276~\206!<\231\0107\276\307&,>\2614\'\275KH\355;\351c\247\275#\322\034<\370o\267=\375\311\034>\3316)\276^\204\326\275\250\376J\275^|\\\275\371=\005\275\252\203\257\275\247\311\300=\ry<<\325P~=vj\342\275\371\"\252\275x\\\021\276\247\370\217>\"\212L>\373\333K<1\234\342\275\223\361\235\275\342\\\371\273\374\201;=1\247B=\\\035\225=\334\230\327<Y\234\002<\320(@>s8!\275\274\007\273\275\267\302\277\274k|\322\275\263\312\013\276Z\366>=J\362Z\275\2338\334\274\315\364\247=|\006\213>\205\231\222\2754\007j<\'\225_>\316\237\221=\274\342\022\276\306\245`>r~\346=%\323\362\274\236\214\017=\202\332\034=\374>\363\275N\276c=\327\021\237\273L\205\025>\323\020\000\272_\252\317\275Bx?>f\2448>fD\340\275\025l\360=\363\316{=m=\207\275\0307\027\276acQ>\263\270a>\327\004\027\276i\272[>\367\224\024\271>\275[>u\343S>\027\216\341\2741;\016>\241\212\301=\353\217\\=*\323\223\275D\253\332<g\336\020>\363\202\001\2752\335\r=\331\376\226>\376\214\337=\220MX\274\315\207}>\367\336C\276\377\314@>Q\304\006\274\327\373\017\276\314\020N;2\247\272\274B\220\n=\355\224\t\275G\372\006=X\366\257\276\366E\235\275A \013\276\033\301\322\273\324\276o<\276\003>\275\014\\V\273D\014\243<;.\253\274K\301\364=\237\344\370\275*\202\250\274\214\271\253\276rr\017>\327\325\345<c\356\024\276\301z\010>\336\035\331\275Q\0351>Y\242\306=\006\356\000\275\365H\362\275\206\245\005\276\355\235\313\275Z]f\275\327\\\024>\016}\244<r\351w=R\217r>\241H\\<G\345)>su~\276v\266$\276?\375|>\323\302\352=\246\256\301=@\346\r>\257\017\033\276\220\376k=\313\367d\276\263y\016>\230\335,\275[\262\364<\364\031/>d\030?\275\377\376\265\272\332.\316\275\354g9\276\032_\323=nT\30382\230\003>$\374\205\275\361(;>6\215\246\275\335\261\231;i.\351\275\324\261%\275a\311=>M\027\321\274\034\027\352=B\306\317\274\306\365\017>\265\230\036\276-k\201<Z\223\264;\021\275\342\275\026f=>\207\220\307\275w\016\251\275\004\017\r\276x\017%\274\256\035\320\275\021\277$\275J\371\214\275\372))\276M\313\372\275\341\025\267>\330\025\256=_\302\332\275\373\221\232><\230\205\275\2514\t\275\226\357\376=\352\016\n>\331\"\014\274\370c\353\275\316\311Y=\000\372J\275\312\001\257\275\224\t\025<\022t\035\27565\243=\366\233/>\272|\212=^g\335\275G{\346\275di\002>\336\262\241\270b\034\364\275\\\3576>i\220\022\275\371\261\252=\222\003\366=[O>=\007wK>\260\314\247=+\004\010\276\321\267M\275a\341\374\274\232\260c\276A\306\330\275\026\255c\274\304R\336=\260&p=\204:\207\276Q\273\031\276,\305E\276\224\n\263\275\31774>@3\024>\033i\260<\253\014\t>hh\310=6o\314=,%\364=\306\303\307\273\257\250\000>*\ty=\375(\345=\255\310\177\276\3258\236=Mb\374\275\220n\234<x6\315=\2562\254\275\264\256u\275\256v\326=8\016\226\275\177\346\">d\212E<\300{\005=\225\367\006\275Z\226\365\275\366},;\377z\323\275\360\263\232>\323\312\367<\244\254\003>B\350\227\276o`N=\300\301\227\275\234\022H>\234#\202\275\253\266\333=\036g<=\\C_\275TX\244<*i\n\275c\216%\276o\350?\275\224\020\354\275\231\214\220\274\314\260\235\275\302\247D\275\205,\037=\331\026\177\276\362\350\304\275{\312\037>\225|\020\276\241\t\010>\023\265\013\274\224\\\n=\241\260\021\276d\203\227>\364~\232<)\022_\275\331\253&\276gvT=\246\032\022=-\037\021\276\307\301V=E\366\354\275\376AA>_\372/\276\216u\207:/\177\245\276`\270\347=ojB\276`\261X\276\277$@\275\3310v\274f|D\276\227\374\215>\030\206\300=Y\201\006>nI\236=\324\372\020=|B\250<\303%1\275\250\340.\276=<\203\273\233\372&>\227\216I=UN\032\275\017\363W\276\241\221\271\273S>\304<\321:[\274\325\377\016>L\270u\276\345pP\275\372\301U\275K\200\020\276A\234\360\273:l|\275\251\377\347\274\213E0>rn\235;\006r\236\274\216\026\342<\307+a\274*\356\307=\2104\322;\326.\210=\036\003\014>\032^\036\276\276Df\275\215\242\014>\266\264\315=D\250\362\275&\220`\276\267j\t>)\006<>\331\277i\275\3763\237\275#\265P>\332\246$\274\223\227\201>\010y\232\275\345\242\036>\014\003\270;\267uQ>\300\016\310<\031\261]\276\333\315\032>\024y4=(\324\033\275\310;[\276d\213\222\275u+\331=pT\223>\274\033\022>\266;\243=,P\327<\260\214\243\275\265m\212\275\334\254\335\274X\026\332\274a\\\346=\307\310K=B>\215\275}\301\202<pC\245=u\3219\276>\315\234=\351\036M\275\364g3>\236#\352\275j\233\204>\232\326N\274%>D\276\376?\235>\033\312\010<\312F\211=\021\225\244<h\266\340<l\245|\275\033\203C\276m\031\364\274\230\277A\276 j\333<&\004D\272s\332\307\276\222^\321=\363\316\374=}\253\226\275\307<\224<\367\325\333=\371\272\266\275\371\0215\275\206\337\355\275ca\313=\313z\013\274,\023\326\275\246\204\230\2751\337\022\276\335h\276\275\261lG=\333\313K>\326\253\341\275\203\303r>$\233\316<\266\370]\276(L+\276A\215\320\274v\205\360=h \330=\240\246\206>\027\363G\274\373\246\277=\335V\\\275\rI\323\274B*\203=\315rV\273U\233\352\274_\204\013>GZ\253\275^\r7>eFE\275@][\276%\010\306=\346C5=\272\263\265\275\207\243\362\274Rv\360\275\227\000\302<\206\026\222=&\262r=\000\027T\276\007\201`\275\323\\\007;N[Q\274\204\356\'>\340\307\234\275\212\363\365\274m\207q>\023\370\t\2769\314\376=e\353\210>$\216i=/\345\211;\214\3325\276\005\370\246=\267^\303>\374\352\006\275\226\341O<\212\316\'=\356\315y=u2\177=\332D\260;\270tc\275Z\355\256\275s\245\343\275~\036\t\276\033I\275=\246hJ;[\326\306\276M\307Z=\305%\336=\255\023E\275\321p\225\275\2041\005>\024I\247\275Pt\325<\233\036k=\223\275\327<1\372\251>\241\305\321=\324\262\301\275\006(&\276\375x\002\275E\021r\275\344`\253<u\241\206\276\213\361\315\275\251\252\023\276\311$\372\274=\035x\276s\262\360\274Hx\314<\355\242l>\256\220X\275\037i\201\274\227zh\276\251Uf\275\314t`\275\000Tm=\225\354(\276\224C,=F\365\253=\276>I>\025p\275\274\372t%>\343\202\330\275\017\263?>\355\024\027=su\367=\347\225\342\275-[\227\275\327hh>\177\263A>VN9>\222\221\033=\304\330F=\327\271\t\276P\311L\276|+0\274\264\301\335:\273\254G\276\321h\035=G\027\200\275IBl=b\225r\275\322\210)=E\336\024\275\027$,>\247\206w\275\341L\">\253K\215\2768\251\243\274\314\263-\276Ht\206\275?\034.<\001\270\027\276\205]\372\274\351\235\265;=\212G=SA\223>WR =\374\341\030\276~hB=\037\234s=K\336\342;\215\325\034\276\217\262\300>\344i\310=\375\002\237=\330\321\276=U\315\213>;\256\177\275\332\216\271\275DP@\275B\354q\274\263\037\253\275\377\361\202\275\323\310V\276\215M\235\275\302\032B\274\220\256\035>\257*y=\336\242u>\362\224\017=\351\221U>}R\214=c\253\035\276\037\t\350\275\353\265\036\275\240\375\016\274$%\256\275\201\246\307=\325Y\013\276E\354};)m\354\275\021\r\177\275Mv\003\276IM\365=f\366\340\275\364\361\001>c\370\230;\362K5=L\227\007>\017\344\334<\217\314\026>\276M\024>\372\341\000\275\261\372\224\275\204m\357\275\014\267\007\275\277\177\360\274\275yp\276\017\344\036\276`\\\230>\230AE>4\331\324\275\216\313+\276\007\314\240=\036\027\014>Ozj\275L>\221\275\t.\217=\036\201\240\275\216\246,>\260x\350=})\366=\243F\337=d\n0\276\207~K>s\004\037\275L\024 \276\005\317\221=N\214C\276\004v\n>3\363\364<A\375\236>\023\023F=T\006\226\275\275\177\026=\r+:\276;I\001=\246f)>.\223\275=\235\330\204\275f\365A=\243L\033\275\004VC>\023]\247=\255\240\313=*\255o=\300i\213\274N\233\t>\'\267\032\276E\251\010\275\276_\034\276v\272\214=\232Y\230\275\225\363\376=\303\021\n>\026\201\347<J\342a<n\360\340=\226(\003\276fX\254\275\312\346\004\276\020\2666>\251\233\030>{\260\002>p\301\371=\245\024K>X\274s=\312\027+\276\225\nY=\240}\017<\235\346\215\2766\335\201\274\260n\017\276\266\370\237<\237\201\210=\267\353\032\276J}\006\276\212)Y\276\306\330,>\361\373x==s\252>\243\211:<U\326h\275\201W<\276\030y\266\275\276\200l\275{4o=\352\346\006=c7 \276p_\267\275\221H}>R\223\311\2752\247\272;\252\264\345=,\016\351\274\3460\227>\2412s=S\024\267=\215\376\321\276\347Z\226\275\330\336\231=\326\001P=vb\246;\3736\n>5\001\260\275w\331\354\275\357\ty<\230\311r<\330(\022>\314Y\316\274\354|\262\274H\233\210=.`\207\275\021\250K>\225\207\222<e\025d\276\\\370\227=\024<D\275\n\017\206=\255-\242\275\271\243\"\276Ys\n>\316\322\331\275|9\201\275]T/\274\204\213\002>\241\265\014\276N\321\020\273=vg\276g\326\344=|\234[>\231\2331\275\007\241\247\275\307!\377=\n;\257\275.VV\275\315\274\252\275\236\217\277\275B\033\203=\205\003]\276\257H\374=dl\265\275m \363\274\227\226\215\275I\246\022=\215K\230\275Q!\032>^n{=\257\275&>dB\243\275\233hJ=\216\264\217<\330\234\354=\000\246\272=\t\313\215\276|\177e\276\261\027\256= Q\374:\351\230c\275\303?\353\275s\367_>\347\351u\275\332\333^>\245\301F\276&\353V\276\201\034\024=\301\022\265=\035c\r\276f\242Q\276=\375\017>\212d\225<\234CG=\324\325\n>\212\340\220\274\210\027i=Z\300\320\275o\346c>\210b\322<\357\324\345;\221\355O\276\256\236\334=k66\275{\205N>\336 \204\275\033Y!\276\2758\313\275\375\033\257=\003\317\211==\365<=C\243\033\275\246\340\353<%\274\\\275\300L\010\276ZB\271\275\306mb\275\254\234\331=\016\3527\276\261\365\002>^\367\225>\350~\327\275\017\315\233\275\010|\203\276R@\017\276\271:\"\2758\273\311=\237\221\367<I\311\347<\306\030\037\276E\227\005\276\215\335\t\276g\307\264\275n\"a\275=\355\341\275\214\024{<\311c\001\275\231\202^\276\2512\227\275\354W\255\275\357R\036\276mg\260=s\317)==qA\276\t\234\242=\353\372\323=\330z\315=\243\211\200\275\205\002\210\275\2407j\276\010*\207\276\350\263\273\274\361\255\311\275\364r\006\276DZ\210\275\016\323\247=\016\265\\>+\231\312\273E\251\250=.\\<>iQ\357=\233\234\232>\356]\300\275\344\314.<\r\242\273\275T#\357\275\022\276\231=\013\014\373\274\311}\003\275\025&\360=\213\347\241\276\005D\027>K\214-\276\254\266\342=J\'k>/1O<\271\317`=rK\272\275\303\3716<&\310\023\275\017\364}=\317n\315=l\272\030=\257\356\352=\204\017\313\275\333>\211>+\036\357=*r\207\276:\3458\276do)\275\323G\323<\303\360_=5s\032\276\346\246;>u\212\256=\2064\367\275\310\357\371\275}\021\033>\243jU\275\360\004\343=\024\016l\275w\272\350\275\321\200\306\274\266W\036\276\356\335\210\275=\314\370\274\207W\032\273\237\246b\276\2549\017\276H\374\341\275\202\334\206=;\'\243=\"\226\032>\233\1776\276\001o\301<\336h\202=\0243\014\276\315\312\237\275?\274D>;\352\312=d\247\254\2759p\334=\215q\221\275rk\340\275\354\275G\276lA\244\274\241tc\276\n`\346\275J\372\024\275\250\242;\275$\240\336\275\262\300w<%\200c\276\352\334\230\276F2\\\276P\333\032;\276\030\035>\007\325\252<\317\nB\275\342\024\300=\017\026\034\275\272H\244>\314\210q\274\001\275\r>\357\321t\274x [>M\260~=\257\257F\276=\324)\2752\243b=<\274\326\275\345$a=\356a!\275\005\177\373\275K6\301\2751\\\244\275,x\016>\364\005\253\275\264\334\253\275\346\375\031\2765\212\317\273*~\374\275jr\232>\341?O>\010\r\201<\026\243<\275\230\240A<\203qP=\"3\313\274t\231c\275\005RA\276 r\306=z*\232\274l\360\204>\2746,\2750\214e\276\300;\t>\223-\204\276\215P\267<\010\243\231\276\014\234\026\274\020\323\342=kU\320\275\246\014\022>\311\353)=\220\0136<\020\335\022\275\231\332\321\275S\270\234\2753\031\234\274#A\325\275\316\261\270<\270a\010\275\345}3=\342^$=5h.\276\006aE\276&B\\\275\036\303c<\372w4>\'\270\271\275"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
